Autodesk.Revit.DB.ParameterFilterElement.GetElementFilterParameters
Retrieves a list of the parameters associated with each rule in the filter.
Returns:
A set of parameter identifiers.
Since:
2019

Autodesk.Revit.DB.ParameterFilterElement.GetRuleParameters
Retrieves a list of the parameters associated with each rule in the filter.
The order of the resulting array corresponds to the order in which the associated
filter rules are applied.
Returns:
An array of parameter identifiers.
Since:
2011

Autodesk.Revit.DB.ParameterFilterElement.GetRuleParameter(Autodesk.Revit.DB.FilterRule)
Returns the parameter for a given filter rule.
Remarks:
If the given rule is a FilterInverseRule, then getRuleParameter will return
the parameter of its inner rule.
rule:
The rule to query.
Returns:
The identifier of the rule's parameter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given rule is not parameter-based.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterElement.AllRuleParametersApplicable(Autodesk.Revit.DB.ElementFilter)
Checks that the parameters of the rules used by the given ElementFilter are valid for this filter's categories.
elementFilter:
The ElementFilter containing the rules to check.
Returns:
True if all the parameters of the given rules are valid for this filter, otherwise false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.ParameterFilterElement.AllRuleParametersApplicable(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.ElementFilter)
Checks that the parameters of the given ElementFilter (representing a combination of rules)
are valid for the given set of categories.
aDocument:
The document containing the filter, categories, and parameters involved in this validation.
categories:
The set of categories against which to check the rule parameters.
elementFilter:
The ElementFilter representing the combination of rules to check.
Returns:
True if all the parameters of the given rules are valid for this filter, otherwise false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.ParameterFilterElement.AllRuleParametersApplicable(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},System.Collections.Generic.IList{Autodesk.Revit.DB.FilterRule})
Checks that the parameters of the given rules are valid for the given set of categories.
aDocument:
The document containing the filter, categories, and parameters involved in this validation.
categories:
The set of categories against which to check the rule parameters.
rules:
The rules to check.
Returns:
True if all the parameters of the given rules are valid for this filter, otherwise false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterElement.AllRuleParametersApplicable(System.Collections.Generic.IList{Autodesk.Revit.DB.FilterRule})
Checks that the parameters of the given rules are valid for this filter's categories.
rules:
The rules to check.
Returns:
True if all the parameters of the given rules are valid for this filter, otherwise false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterElement.ClearRules
Removes all rules from this filter.
Since:
2011

Autodesk.Revit.DB.ParameterFilterElement.SetElementFilter(Autodesk.Revit.DB.ElementFilter)
Sets the rules that must be satisfied for a given element to pass this filter.
Remarks:
Note that in some situation, calling GetElementFilter after calling SetElementFilter
may return an ElementFilter that is structurally different from the one passed as input
to SetElementFilter. For example, if the input ElementFilter contains an ElementParameterFilter
that contains more than one FilterRule, and if the view filters dialog box is used in between
the calls to SetElementFilter and GetElementFilter, the output ElementFilter will use a single
ElementParameterFilter for each of the FilterRules that were bundled in an input ElementParameterFilter.
The two ElementFilters will be logically and functionally equivalent in the sense that any given
Element will either be accepted by both ElementFilters or rejected by both ElementFilters.
elementFilter:
An ElementFilter representing the rules. It may be an ElementParameterFilter
representing a conjunction of one or more FilterRules, or an ElementLogicalFilter
(of type LogicalAndFilter or LogicalOrFilter) representing a logical combination
of FilterRules, using AND/OR operations.
Returns:
Returns true if this ParameterFilterElement was changed, false if not.
It will not be changed if the input rules are equivalent to the ParameterFilterElement's
existing rules.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One of the given rules refers to a parameter that does not apply to this filter's categories.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The ElementFilter is not acceptable for use by a ParameterFilterElement.
Since:
2019

Autodesk.Revit.DB.ParameterFilterElement.SetRules(System.Collections.Generic.IList{Autodesk.Revit.DB.FilterRule})
Sets the rules, all of which must be satisfied for a given
element to pass this filter.
Remarks:
The rules are applied in the order given.  If an element fails
to pass a certain rule, no further testing is done.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One of the given rules refers to a parameter that does not apply to this filter's categories.
-or-
One of the rules in the given array is null.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterElement.GetElementFilter
Returns an ElementFilter representing the combination of rules used by this filter.
Remarks:
Note that in some situation, calling GetElementFilter after calling SetElementFilter
may return an ElementFilter that is structurally different from the one passed as input
to SetElementFilter. For example, if the input ElementFilter contains an ElementParameterFilter
that contains more than one FilterRule, and if the view filters dialog box is used in between
the calls to SetElementFilter and GetElementFilter, the output ElementFilter will use a single
ElementParameterFilter for each of the FilterRules that were bundled in an input ElementParameterFilter.
The two ElementFilters will be logically and functionally equivalent in the sense that any given
Element will either be accepted by both ElementFilters or rejected by both ElementFilters.
Returns:
An ElementFilter representing the rules. It may be an ElementParameterFilter
representing a conjunction of one or more FilterRules, or an ElementLogicalFilter
(of type LogicalAndFilter or LogicalOrFilter) representing a logical combination
of FilterRules, using AND/OR operations.
Since:
2019

Autodesk.Revit.DB.ParameterFilterElement.GetRules
Returns the rules of this filter, in the order in which they are applied.
Remarks:
This function should only be called if usesConjunctionOfFilterRules returns 'true'.
Since:
2011

Autodesk.Revit.DB.ParameterFilterElement.UsesConjunctionOfFilterRules
Returns 'true' if and only if this ParameterFilterElement uses a pure conjunction ("ANDing together") of FilterRules.
Returns:
True if this filter uses a pure conjunction of FilterRules, false if not.
Since:
2019

Autodesk.Revit.DB.ParameterFilterElement.ElementFilterIsAcceptableForParameterFilterElement(Autodesk.Revit.DB.Document,System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.ElementFilter)
Checks that an ElementFilter is acceptable for use in defining the filtering rules
for a given list of categories (i.e., for view filtering).
aDocument:
The document in which to create the ParameterFilterElement.
categories:
The categories for the new ParameterFilterElement.
elementFilter:
The ElementFilter to validate.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.ParameterFilterElement.ElementFilterIsAcceptableForParameterFilterElement(Autodesk.Revit.DB.ElementFilter)
Checks that an ElementFilter is acceptable for use in defining the filtering rules
for a ParameterFilterElement (i.e., for view filtering).
elementFilter:
The ElementFilter to validate.
Returns:
True if the ElementFilter is acceptable for use by an ParameterFilterElement, false if not.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.ParameterFilterElement.SetCategories(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Sets the categories admitted by this filter.
Remarks:
Testing that an element's category is a member of this set is,
essentially, the first rule of the filter.
Changing the set of categories will clear any rules that use parameters
that are not applicable for the new set of categories.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterElement.GetCategories
Gets the categories admitted by this filter.
Since:
2011

Autodesk.Revit.DB.ParameterFilterElement.Create(Autodesk.Revit.DB.Document,System.String,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.ElementFilter)
Creates a new ParameterFilterElement in the given document.
aDocument:
The document in which to create the ParameterFilterElement.
name:
The user-visible name for the new ParameterFilterElement.
categories:
The categories for the new ParameterFilterElement.
elementFilter:
The rules for the new ParameterFilterElement, represented as an ElementFilter
The ElementFilter must be either an ElementParameterFilter or an ElementLogicalFilter
containing only ElementParameterFilters and other ElementLogicalFilters. The former
can be used if desired to represent a single FilterRule, while the latter allows
arbitrary logical combinations of FilterRules using AND/OR operations.
For example: "Length > 100.0" AND ("Area < 200.0" OR "Volume < 500.0").
Returns:
A pointer to the new ParameterFilterElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string or contains only whitespace.
-or-
name cannot include prohibited characters.
-or-
The given value for name is already in use as a filter element name.
-or-
One of the given rules refers to a parameter that does not apply to this filter's categories.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The ElementFilter is not acceptable for use by a ParameterFilterElement.
Since:
2019

Autodesk.Revit.DB.ParameterFilterElement.Create(Autodesk.Revit.DB.Document,System.String,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},System.Collections.Generic.IList{Autodesk.Revit.DB.FilterRule})
Creates a new ParameterFilterElement in the given document.
aDocument:
The document in which to create the ParameterFilterElement.
name:
The user-visible name for the new ParameterFilterElement.
categories:
The categories for the new ParameterFilterElement.
rules:
The rules for the new ParameterFilterElement.
Returns:
A pointer to the new ParameterFilterElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string or contains only whitespace.
-or-
name cannot include prohibited characters.
-or-
The given value for name is already in use as a filter element name.
-or-
One of the given rules refers to a parameter that does not apply to this filter's categories.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterElement.Create(Autodesk.Revit.DB.Document,System.String,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Creates a new ParameterFilterElement in the given document.
aDocument:
The document in which to create the ParameterFilterElement.
name:
The user-visible name for the new ParameterFilterElement.
categories:
The categories for the new ParameterFilterElement.
Returns:
A pointer to the new ParameterFilterElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string or contains only whitespace.
-or-
name cannot include prohibited characters.
-or-
The given value for name is already in use as a filter element name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterElement
Admits elements that satisfy two conditions:
The element's category must be one of a certain set of allowed categories.The element must pass a series of filter rules.
Since:
2011